export const CFG = {
    particleCount: 8000, riverWidth: 600, pixelsPerYear: 250,
    camSpeed: 0.08, starSpeed: 8, viewDepth: 6000
};

export const THEMES = {
    peiyang: { h: 35, s: 90, l: 60, hex: '#ffaa33', rgb: '255, 170, 51' },
    chaos:   { h: 350, s: 80, l: 50, hex: '#ff0055', rgb: '255, 0, 85' },
    tju:     { h: 190, s: 90, l: 60, hex: '#00f3ff', rgb: '0, 243, 255' },
    future:  { h: 220, s: 10, l: 90, hex: '#ffffff', rgb: '255, 255, 255' }
};

// 真实经纬度坐标（用于D3投影）
export const CITY_GEO_COORDS = {
    "天津": [117.200983, 39.084158],
    "西安": [108.93977, 34.341574],
    "城固": [107.333673, 33.156606], // 汉中城固
    "贵阳": [106.630154, 26.647661],
    "泰顺": [119.717757, 27.567823], // 温州泰顺
    "福州": [119.29653, 26.074508],
    "深圳": [114.057868, 22.543099],
    "青岛": [120.382641, 36.067082],
    "合肥": [117.227239, 31.820587],
    "上虞": [120.869, 30.0306],
    "泉州": [118.5898, 24.9089],
    "雄安": [115.99, 38.91],
    "淄博": [118.047, 36.814],
    "开封": [114.307581, 34.797049],
    "宁波": [121.543948, 29.867806],
    "秦皇岛": [119.599021, 39.935386],
    "成都": [104.066801, 30.572816]
};

// 城市名到省份名/区域名的映射，用于高亮区块
export const CITY_TO_PROV = {
    "天津": "天津市",
    "西安": "陕西省",
    "城固": "陕西省",
    "贵阳": "贵州省",
    "泰顺": "浙江省",
    "福州": "福建省",
    "深圳": "广东省",
    "上虞": "浙江省",
    "青岛": "山东省",
    "泉州": "福建省",
    "雄安": "河北省",
    "淄博": "山东省",
    "合肥": "安徽省",
    "开封": "河南省",
    "宁波": "浙江省",
    "秦皇岛": "河北省",
    "成都": "四川省"
};
