export const RAW_DATA = {
    "inflows": [
        { "year": 1952, "source": "南开大学", "dept": "工学院", image: "./college/nankai.png", "desc": "1952年，南开大学工学院整体并入天津大学。", intro: "创立于1919年，1938年迁往昆明、与清华大学、北京大学合并为国立西南联合大学。1946年复校，1958年拆分出天津财经学院，1994年合并天津对外贸易学院，2010年合并中国旅游管理干部学院" },
        { "year": 1952, "source": "津沽大学", "dept": "工学院", image: "./college/jingu.png", "desc": "津沽大学工学院并入天津大学。", intro: "创立于1921年初名“天津农工商大学”上世纪上半期国内顶端的私立大学、中国第二所天主教教会学校，代表着教会学校在全国的高水平办学条件。1951年改为国立，1952年被拆分并划入天津大学、南开大学、天津师范学院" },
        { "year": 1952, "source": "清华大学", "dept": "化学工程系", image: "./college/qinghua.png", "desc": "清华大学化学工程系并入，奠定天大化工地位。", intro: "1911年成立清华学堂，后更名国立清华大学，1936年迁至昆明、与北京大学、南开大学合并为国立西南联合大学，1946年复校。1952年经院系调整后成为多科性工科大学" },
        { "year": 1952, "source": "北京大学", "dept": "化学工程系", image: "college/beijing.png", "desc": "北京大学化学工程系调整至天津大学。", intro: "1898年成立京师大学堂，后改名国立北京大学，1919年学生参与五四运动。1936年迁至昆明、与北京大学、南开大学合并为国立西南联合大学。1952年院系调整后成为文理科为主的综合性大学" },
        { "year": 1952, "source": "燕京大学", "dept": "化学工程系", image: "./college/yanjing.png", "desc": "燕京大学化学工程系并入天津大学。", intro: "1896年创建于山海关，始称“北洋铁路官学堂”，是中国第一所工程教育高等学府，后经历唐山路矿学堂、唐山交通大学、国立唐山工学院等时期。1952年，学校更名为唐山铁道学院。1964年学校迁至四川峨眉，1972年更名西南交通大学" },
        { "year": 1952, "source": "唐山铁道学院", "dept": "化学工程系", image: "college/tangtie.png", "desc": "唐山铁道学院化工系调整至天津大学。", intro: "创办于1919年，由美国及英国基督教教会在北京联合开办，是近代中国规模最大、质量最好的大学之一，到1930年代已经跻身于世界一流大学之列。在中国高校1952年院系调整中，燕京大学被撤销" },
        { "year": 1952, "source": "北京铁道学院", "dept": "建筑工程系", image: "college/beitie.png", "desc": "北京铁道学院建筑工程系并入。", intro: "前身为国立交通大学的北京和唐山校区。1949年由北平铁道管理学院、华北交通学院、唐山工学院合并组建为“中国交通大学”，历经北方交通大学、北京铁道学院等时期。2000年与北京电力高等专科学校合并为北京交通大学" }
    ],
    "outflows": [
        { "year": 1951, "target": "北京航空航天大学", "dept": "航空系", image: "college/beihang.png", "desc": "抽调航空系参与组建北京航空学院。", intro: "1951年清华大学、北洋大学、西北工学院、厦门大学的航空系划归清华大学；云南大学航空系划归四川大学；原中央工业专科学校航空科和华北大学航空系合并为北京工业学院航空系。1952年继续合并为北京航空学院，1988年改名北京航空航天大学" },
        { "year": 1952, "target": "中国矿业大学", "dept": "采矿系采煤组", image: "college/kuangye.png", "desc": "采矿系采煤组调至中国矿业学院。", intro: "前身是1909年创办的焦作路矿学堂，后改为焦作工学院。1952年合并华北多所高校的采矿科系、在天津成立中国矿业学院，随后迁往北京，1970年外迁至四川合川，1978年在徐州复校，1988年改名为中国矿业大学" },
        { "year": 1952, "target": "中国石油大学", "dept": "化工系石油炼制组", image: "college/shiyou.png", "desc": "化工系石油炼制组调至北京石油学院。", intro: "1953年以清华大学石油工程系为基础，汇聚北京大学、天津大学、大连工学院等著名高校的力量，组建北京石油学院。后搬迁至东营并更名为华东石油学院。1981年研究生部回到北京，并形成两地办学的局面" },
        { "year": 1952, "target": "中国石油大学", "dept": "机械系石油机械组", image: "college/shiyou.png", "desc": "机械系石油机械组调至北京石油学院。", intro: "1953年以清华大学石油工程系为基础，汇聚北京大学、天津大学、大连工学院等著名高校的力量，组建北京石油学院。后搬迁至东营并更名为华东石油学院。1981年研究生部回到北京，并形成两地办学的局面" },
        { "year": 1952, "target": "中国石油大学", "dept": "地质系石油地质组", image: "college/shiyou.png", "desc": "地质系石油地质组调至北京石油学院。", intro: "1953年以清华大学石油工程系为基础，汇聚北京大学、天津大学、大连工学院等著名高校的力量，组建北京石油学院。后搬迁至东营并更名为华东石油学院。1981年研究生部回到北京，并形成两地办学的局面" },
        { "year": 1952, "target": "中国石油大学", "dept": "采矿系采石油组", image: "college/shiyou.png", "desc": "采矿系采石油组调至北京石油学院。", intro: "1953年以清华大学石油工程系为基础，汇聚北京大学、天津大学、大连工学院等著名高校的力量，组建北京石油学院。后搬迁至东营并更名为华东石油学院。1981年研究生部回到北京，并形成两地办学的局面" },
        { "year": 1952, "target": "中国地质大学", "dept": "地质系", image: "college/dizhi.png", "desc": "地质系调至北京地质学院。", intro: "1952年合并北京大学、清华大学、天津大学、唐山铁道学院等校的地质、工程等系科，组建北京地质学院。1975年迁至武汉并更名武汉地质学院，1987年更名中国地质大学，在北京和武汉两地办学" },
        { "year": 1952, "target": "南开大学", "dept": "数学系", image: "college/nankai.png", "desc": "数学系调整至南开大学。", intro: "创立于1919年，1938年迁往昆明、与清华大学、北京大学合并为国立西南联合大学。1946年复校，1958年拆分出天津财经学院，1994年合并天津对外贸易学院，2010年合并中国旅游管理干部学院" },
        { "year": 1952, "target": "南开大学", "dept": "物理系", image: "college/nankai.png", "desc": "物理系调整至南开大学。", intro: "创立于1919年，1938年迁往昆明、与清华大学、北京大学合并为国立西南联合大学。1946年复校，1958年拆分出天津财经学院，1994年合并天津对外贸易学院，2010年合并中国旅游管理干部学院" },
        { "year": 1952, "target": "北京科技大学", "dept": "采矿系采金属组", image: "college/beike.png", "desc": "采矿系采金属组调至北京钢铁工业学院。", intro: "1952年合并北洋大学、唐山铁道学院、山西大学、北京工业学院、西北工学院、清华大学等校的采矿和冶金系，成立北京钢铁工业学院。1988年改名为北京科技大学" },
        { "year": 1952, "target": "北京科技大学", "dept": "冶金系", image: "college/beike.png", "desc": "冶金系调至北京钢铁工业学院。", intro: "1952年合并北洋大学、唐山铁道学院、山西大学、北京工业学院、西北工学院、清华大学等校的采矿和冶金系，成立北京钢铁工业学院。1988年改名为北京科技大学" },
        { "year": 1954, "target": "中央燃料工业部", "dept": "附属石油专业学校", image: "college/ranliao.png", "desc": "附属石油专业学校划归中央燃料工业部。", intro: "起源于1903年创办的北洋工艺学堂，后并入河北工学院，1952年从天津大学拆分为天津大学附设石油工业学校，后改名河北石油学院、承德石油高等专科学校。2020年与河北工业大学城市学院合并设立河北石油职业技术大学" },
        { "year": 1955, "target": "武汉大学", "dept": "水利系农田水利及土壤改良专业", image: "college/wuhan.png", "desc": "水利系农田水利及土壤改良专业调至武汉水利学院。", intro: "1913年，成立国立武昌高等师范学校，后改名国立武昌大学，后合并多所院校成立国立武昌中山大学。1949年改为国立武汉大学。2000年合并武汉水利电力大学、武汉测绘科技大学、湖北医科大学" },
        { "year": 1955, "target": "北京邮电大学", "dept": "电信系", image: "college/youdian.png", "desc": "电信系调出参与组建北京邮电学院。", intro: "1955年，以天津大学电讯系、电话电报通讯和无线电通信广播两个专业、重庆大学电机系电话电报通讯专业为基础组建北京邮电学院，后合并北京电信学院、邮电科技大学。1993年改名北京邮电大学" },
        { "year": 1955, "target": "天津工业大学", "dept": "纺织工程系", image: "college/tiangong.png", "desc": "纺织工程系调出成立河北纺织工学院。", intro: "1958年由天津大学纺织工程系、天津纺织工业学校、川乐山技艺专科学校棉纺织科合并组建河北纺织工学院，1968年改名为天津纺织工学院。后与天津工业经济管理干部学院、天津工业职业技术学院合并，更名为天津工业大学" },
        { "year": 1956, "target": "武汉大学", "dept": "土木工程系测量专业", image: "college/wuhan.png", "desc": "土木工程系测量专业调至武汉测绘学院。", intro: "1913年，成立国立武昌高等师范学校，后改名国立武昌大学，后合并多所院校成立国立武昌中山大学。1949年改为国立武汉大学。2000年合并武汉水利电力大学、武汉测绘科技大学、湖北医科大学" },
        { "year": 1960, "target": "华北理工大学", "dept": "矿冶工程系", image: "college/huabei.png", "desc": "矿冶工程系调往唐山成立河北矿冶学院。", intro: "1958~1959年抽调唐山铁道学院和天津大学矿冶系成立唐山矿冶学院，后改名河北矿冶学院、河北理工大学；1963年组建唐山煤矿医学院，后改名华北煤炭医学院。2010年两校合并成立河北联合大学，后改名华北理工大学" },
        { "year": 1970, "target": "天津科技大学", "dept": "化工系造纸专业", image: "college/tianke.png", "desc": "化工系造纸专业调往天津轻工业学院。", intro: "1958年成立河北轻工业学院，次年天津大学化学工程系造纸专业并入，1968年改名天津轻工业学院，后合并多所高校的造纸、盐化等专业。2002年改名天津科技大学" }
    ],
    "branches": [
        { "year": 1978, "target": "天津理工大学", "label": "分院独立", image: "college/tianli.png", "desc": "原天大一、二、三分院合并发展为天津理工。", intro: "1979年成立天津大学理工分校，后改名天津理工学院。1996年与天津大学机电、冶金分校合并，2004年改名天津理工大学" },
        { "year": 1978, "target": "天津城建大学", "label": "分院独立", image: "college/tiancheng.png", "desc": "原天大建筑分院独立发展为天津城建。", intro: "1979年成立天津大学第四分校，随即改名天津大学建筑分校。1985年改名天津城市建设学院，2013年改名天津城建大学" }
    ]
};
